/**
 * @file ui.c
 * @brief UI模块的主实现文件
 */

/*********************
 *      INCLUDES
 *********************/
#include "ui.h"
#include "display/app_display.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 *  STATIC PROTOTYPES
 **********************/

/**********************
 *  STATIC VARIABLES
 **********************/

/**********************
 *      MACROS
 **********************/

/**********************
 *   GLOBAL FUNCTIONS
 **********************/

/**
 * @brief 初始化UI模块
 */
void ui_init(void)
{
    // 调用显示模块的初始化函数
    app_display_init();
}

/**********************
 *   STATIC FUNCTIONS
 **********************/